In [5]:
import numpy as np
import pandas as pd

In [42]:
df = np.matrix([[1,0,0,1],[0,0,0,0],[1,1,0,1],[1,1,0,1]])

In [53]:
df = pd.DataFrame(df)

In [54]:
df

   0  1  2  3
0  1  0  0  1
1  0  0  0  0
2  1  1  0  1
3  1  1  0  1

In [58]:
np.where(df.index.values==2)[0][0]

2

In [52]:
df[[0,1]]

   0  1
0  1  0
1  0  0
2  1  1
3  1  1

In [46]:
df[df.columns[(df != 0).any()]]

   0  1  3
0  1  0  1
1  0  0  0
2  1  1  1
3  1  1  1

In [18]:
df = df[(df.T != 0).any()]

In [50]:
(df.T != 0).any()

0     True
1    False
2     True
3     True
dtype: bool